app/controllers/shops_controller.rb

def edit
  @shop = Shop.find(params[:id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", 21]]

def create
  @shop = Shop.new(shop_params)

  if @shop.save
---
INSERT INTO "shops" ("name", "chain", "latitude", "longitude", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "ae"], ["chain", "adf"], ["latitude", "45"], ["longitude", "68"], ["address", "zaeaz"], ["created_at", "2016-05-15 11:29:14.632418"], ["updated_at", "2016-05-15 11:29:14.632418"]]

def update
  @shop = Shop.find(params[:id])

  if (@shop.update(shop_params))
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "shops" SET "chain" = ?, "latitude" = ?, "longitude" = ?, "address" = ?, "city" = ?, "zip" = ?, "phone" = ?, "country_code" = ?, "updated_at" = ? WHERE "shops"."id" = ?

def destroy
  @shop = Shop.find(params[:id])

  @shop.destroy
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "shops" WHERE "shops"."id" = ?  [["id", 2]]

def find
  @distance = 0.5
  @limit = 10
  if (params.has_key?(:dist))
    @distance = params[:dist].to_f
    if (@distance < 0)
      @distance = 0.5
    end
  end
  if (params.has_key?(:limit))
    @limit = params[:limit].to_f
    if (@limit < 1)
      @limit = 10
    end
  end
  @userCoord = Geokit::Geocoders::IpGeocoder.geocode(request.remote_ip)
  @coord = Array.new
  @shops = Array.new
  if (@userCoord.success == false)
    puts("Couldn't get IP, choosing default (Paris)")
    @coord = [48.856614, 2.352222];
  else
    @coord = [@userCoord.lat, @userCoord.lng]
  end
  Shop.all.each do |shop|
---
SELECT "shops".* FROM "shops" WHERE ((

def index
  @shops = Shop.all
---
SELECT "shops".* FROM "shops"

def show
  @shop = Shop.find(params[:id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", 20]]